In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [23]:
data = pd.read_csv('https://raw.githubusercontent.com/guptaprins/Applied-AI-Course-1/master/Lecture-Notes/7%20-%20Pandas/3_Key%20operations%20on%20Dataframes/weather_data_cities.csv')

In [14]:
data.shape

(12, 5)

In [12]:
data.to_excel ('Excel_Sheet.xlsx', sheet_name = 'Data_1', index = False)

In [7]:
grp_data = data.groupby ('city')

In [8]:
max_data = grp_data.max()

In [9]:
mean_data = grp_data.mean()

In [10]:
'''This will JOIN the two data (by default, it's inner join)'''

merged_data = pd.merge (max_data, mean_data, on = 'city')

In [11]:
merged_data

,day,temperature_x,windspeed_x,event,temperature_y,windspeed_y
city,,,,,,
mumbai,1/4/2017,92,15,Sunny,88.50,9.25
new york,1/4/2017,36,12,Sunny,32.25,8.00
paris,1/4/2017,54,20,Sunny,47.75,12.75

In [12]:
'''This will get all the data as it is an outer JOIN'''

outer_merged_data = pd.merge (max_data, mean_data, on = 'city', how = 'outer')

In [31]:
'''While creating a dataframe in Pandas, one can also assign custom INDEX number, by using the command INDEX'''

df1 = pd.DataFrame (range (3,18), index = range (21, 36))

In [32]:
df1

     0
21   3
22   4
23   5
24   6
25   7
26   8
27   9
28  10
29  11
30  12
31  13
32  14
33  15
34  16
35  17

In [35]:
''' LOC vs ILOC'''
''' Loc uses the INDEX number and Iloc uses the row. In the above example, we gave the custome indices, hence 
    loc uses that reference, whereas iloc uses the original row number, irrespective of the index defined'''

''' loc ---> INDEX no
    iloc --> Original row no'''


df1.loc [32]

0    14
Name: 32, dtype: int64

In [37]:
df1.iloc [11]

0    14
Name: 32, dtype: int64